results/iterations/redis_2mb_latency_iter7.txt
====== SET ======
  1000000 requests completed in 11.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 598482)
75.000% <= 0.295 milliseconds (cumulative count 842368)
87.500% <= 0.303 milliseconds (cumulative count 954899)
96.875% <= 0.311 milliseconds (cumulative count 987161)
99.219% <= 0.319 milliseconds (cumulative count 994712)
99.609% <= 0.327 milliseconds (cumulative count 996874)
99.805% <= 0.343 milliseconds (cumulative count 998153)
99.902% <= 0.463 milliseconds (cumulative count 999121)
99.951% <= 0.479 milliseconds (cumulative count 999746)
99.976% <= 0.487 milliseconds (cumulative count 999869)
99.988% <= 0.495 milliseconds (cumulative count 999911)
99.994% <= 0.535 milliseconds (cumulative count 999941)
99.997% <= 0.847 milliseconds (cumulative count 999970)
99.998% <= 1.063 milliseconds (cumulative count 999985)
99.999% <= 1.167 milliseconds (cumulative count 999994)
100.000% <= 1.215 milliseconds (cumulative count 999997)
100.000% <= 1.255 milliseconds (cumulative count 1000000)
100.000% <= 1.255 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 14)
95.490% <= 0.303 milliseconds (cumulative count 954899)
99.871% <= 0.407 milliseconds (cumulative count 998712)
99.992% <= 0.503 milliseconds (cumulative count 999923)
99.995% <= 0.607 milliseconds (cumulative count 999950)
99.996% <= 0.703 milliseconds (cumulative count 999957)
99.997% <= 0.807 milliseconds (cumulative count 999966)
99.997% <= 0.903 milliseconds (cumulative count 999974)
99.998% <= 1.007 milliseconds (cumulative count 999981)
99.999% <= 1.103 milliseconds (cumulative count 999988)
100.000% <= 1.207 milliseconds (cumulative count 999996)
100.000% <= 1.303 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89605.73 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.303     0.319     1.255
====== GET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 594763)
75.000% <= 0.295 milliseconds (cumulative count 836288)
87.500% <= 0.303 milliseconds (cumulative count 950741)
96.875% <= 0.311 milliseconds (cumulative count 985778)
99.219% <= 0.319 milliseconds (cumulative count 994295)
99.609% <= 0.327 milliseconds (cumulative count 996673)
99.805% <= 0.351 milliseconds (cumulative count 998209)
99.902% <= 0.463 milliseconds (cumulative count 999124)
99.951% <= 0.471 milliseconds (cumulative count 999513)
99.976% <= 0.479 milliseconds (cumulative count 999774)
99.988% <= 0.495 milliseconds (cumulative count 999925)
99.994% <= 0.503 milliseconds (cumulative count 999949)
99.997% <= 0.543 milliseconds (cumulative count 999970)
99.998% <= 0.575 milliseconds (cumulative count 999986)
99.999% <= 0.591 milliseconds (cumulative count 999996)
100.000% <= 0.599 milliseconds (cumulative count 1000000)
100.000% <= 0.599 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 15)
95.074% <= 0.303 milliseconds (cumulative count 950741)
99.866% <= 0.407 milliseconds (cumulative count 998657)
99.995% <= 0.503 milliseconds (cumulative count 999949)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89341.55 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.104     0.287     0.303     0.319     0.599