results/iterations/redis_2mb_latency_iter8.txt
====== SET ======
  1000000 requests completed in 11.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 598430)
75.000% <= 0.295 milliseconds (cumulative count 836691)
87.500% <= 0.303 milliseconds (cumulative count 948130)
96.875% <= 0.311 milliseconds (cumulative count 980025)
98.438% <= 0.319 milliseconds (cumulative count 987831)
99.219% <= 0.351 milliseconds (cumulative count 992687)
99.609% <= 0.479 milliseconds (cumulative count 996395)
99.805% <= 0.519 milliseconds (cumulative count 998169)
99.902% <= 0.567 milliseconds (cumulative count 999123)
99.951% <= 0.599 milliseconds (cumulative count 999554)
99.976% <= 0.671 milliseconds (cumulative count 999756)
99.988% <= 1.039 milliseconds (cumulative count 999878)
99.994% <= 1.447 milliseconds (cumulative count 999939)
99.997% <= 1.847 milliseconds (cumulative count 999970)
99.998% <= 2.471 milliseconds (cumulative count 999985)
99.999% <= 2.639 milliseconds (cumulative count 999993)
100.000% <= 2.735 milliseconds (cumulative count 999997)
100.000% <= 2.807 milliseconds (cumulative count 999999)
100.000% <= 2.831 milliseconds (cumulative count 1000000)
100.000% <= 2.831 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 26)
94.813% <= 0.303 milliseconds (cumulative count 948130)
99.480% <= 0.407 milliseconds (cumulative count 994801)
99.756% <= 0.503 milliseconds (cumulative count 997556)
99.962% <= 0.607 milliseconds (cumulative count 999623)
99.976% <= 0.703 milliseconds (cumulative count 999764)
99.979% <= 0.807 milliseconds (cumulative count 999794)
99.983% <= 0.903 milliseconds (cumulative count 999832)
99.987% <= 1.007 milliseconds (cumulative count 999867)
99.990% <= 1.103 milliseconds (cumulative count 999896)
99.991% <= 1.207 milliseconds (cumulative count 999912)
99.992% <= 1.303 milliseconds (cumulative count 999925)
99.993% <= 1.407 milliseconds (cumulative count 999935)
99.995% <= 1.503 milliseconds (cumulative count 999945)
99.995% <= 1.607 milliseconds (cumulative count 999952)
99.996% <= 1.703 milliseconds (cumulative count 999961)
99.997% <= 1.807 milliseconds (cumulative count 999968)
99.997% <= 1.903 milliseconds (cumulative count 999973)
99.998% <= 2.007 milliseconds (cumulative count 999976)
100.000% <= 3.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89229.95 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.287     0.104     0.287     0.311     0.327     2.831
====== GET ======
  1000000 requests completed in 11.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 589488)
75.000% <= 0.295 milliseconds (cumulative count 823921)
87.500% <= 0.303 milliseconds (cumulative count 942552)
96.875% <= 0.311 milliseconds (cumulative count 981684)
98.438% <= 0.319 milliseconds (cumulative count 991724)
99.219% <= 0.327 milliseconds (cumulative count 994433)
99.609% <= 0.343 milliseconds (cumulative count 996156)
99.805% <= 0.415 milliseconds (cumulative count 998269)
99.902% <= 0.479 milliseconds (cumulative count 999242)
99.951% <= 0.495 milliseconds (cumulative count 999651)
99.976% <= 0.503 milliseconds (cumulative count 999778)
99.988% <= 0.535 milliseconds (cumulative count 999878)
99.994% <= 0.863 milliseconds (cumulative count 999939)
99.997% <= 9.375 milliseconds (cumulative count 999970)
99.998% <= 9.655 milliseconds (cumulative count 999985)
99.999% <= 9.823 milliseconds (cumulative count 999993)
100.000% <= 9.895 milliseconds (cumulative count 999997)
100.000% <= 9.927 milliseconds (cumulative count 999999)
100.000% <= 9.951 milliseconds (cumulative count 1000000)
100.000% <= 9.951 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 20)
94.255% <= 0.303 milliseconds (cumulative count 942552)
99.804% <= 0.407 milliseconds (cumulative count 998041)
99.978% <= 0.503 milliseconds (cumulative count 999778)
99.993% <= 0.607 milliseconds (cumulative count 999926)
99.993% <= 0.703 milliseconds (cumulative count 999931)
99.994% <= 0.807 milliseconds (cumulative count 999936)
99.994% <= 0.903 milliseconds (cumulative count 999940)
99.994% <= 1.007 milliseconds (cumulative count 999944)
99.995% <= 1.103 milliseconds (cumulative count 999948)
99.995% <= 1.207 milliseconds (cumulative count 999950)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89174.25 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.287     0.104     0.287     0.311     0.319     9.951