results/iterations/redis_2mb_latency_iter9.txt
====== SET ======
  1000000 requests completed in 11.19 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 593833)
75.000% <= 0.295 milliseconds (cumulative count 824946)
87.500% <= 0.303 milliseconds (cumulative count 928332)
93.750% <= 0.311 milliseconds (cumulative count 966489)
96.875% <= 0.319 milliseconds (cumulative count 983989)
98.438% <= 0.327 milliseconds (cumulative count 992464)
99.609% <= 0.343 milliseconds (cumulative count 997185)
99.805% <= 0.367 milliseconds (cumulative count 998148)
99.902% <= 0.479 milliseconds (cumulative count 999223)
99.951% <= 0.495 milliseconds (cumulative count 999603)
99.976% <= 0.511 milliseconds (cumulative count 999799)
99.988% <= 0.535 milliseconds (cumulative count 999881)
99.994% <= 0.647 milliseconds (cumulative count 999939)
99.997% <= 1.031 milliseconds (cumulative count 999970)
99.998% <= 1.359 milliseconds (cumulative count 999985)
99.999% <= 1.447 milliseconds (cumulative count 999994)
100.000% <= 1.487 milliseconds (cumulative count 999997)
100.000% <= 1.519 milliseconds (cumulative count 1000000)
100.000% <= 1.519 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 18)
92.833% <= 0.303 milliseconds (cumulative count 928332)
99.846% <= 0.407 milliseconds (cumulative count 998464)
99.973% <= 0.503 milliseconds (cumulative count 999734)
99.992% <= 0.607 milliseconds (cumulative count 999925)
99.995% <= 0.703 milliseconds (cumulative count 999948)
99.995% <= 0.807 milliseconds (cumulative count 999951)
99.996% <= 0.903 milliseconds (cumulative count 999958)
99.997% <= 1.007 milliseconds (cumulative count 999967)
99.998% <= 1.103 milliseconds (cumulative count 999977)
99.998% <= 1.207 milliseconds (cumulative count 999979)
99.998% <= 1.303 milliseconds (cumulative count 999980)
99.999% <= 1.407 milliseconds (cumulative count 999990)
100.000% <= 1.503 milliseconds (cumulative count 999998)
100.000% <= 1.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89333.57 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.311     0.327     1.519
====== GET ======
  1000000 requests completed in 11.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 613952)
75.000% <= 0.295 milliseconds (cumulative count 847924)
87.500% <= 0.303 milliseconds (cumulative count 955670)
96.875% <= 0.311 milliseconds (cumulative count 986688)
99.219% <= 0.319 milliseconds (cumulative count 994015)
99.609% <= 0.327 milliseconds (cumulative count 996168)
99.805% <= 0.383 milliseconds (cumulative count 998127)
99.902% <= 0.479 milliseconds (cumulative count 999303)
99.951% <= 0.487 milliseconds (cumulative count 999644)
99.976% <= 0.495 milliseconds (cumulative count 999829)
99.988% <= 0.503 milliseconds (cumulative count 999912)
99.994% <= 0.511 milliseconds (cumulative count 999958)
99.997% <= 0.519 milliseconds (cumulative count 999970)
99.998% <= 0.575 milliseconds (cumulative count 999989)
99.999% <= 0.583 milliseconds (cumulative count 999995)
100.000% <= 0.591 milliseconds (cumulative count 1000000)
100.000% <= 0.591 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.001% <= 0.207 milliseconds (cumulative count 12)
95.567% <= 0.303 milliseconds (cumulative count 955670)
99.839% <= 0.407 milliseconds (cumulative count 998392)
99.991% <= 0.503 milliseconds (cumulative count 999912)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89533.53 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.285     0.096     0.287     0.303     0.319     0.591